{"id":11132929,"deleted":0,"type":"story","by":"brakmic","time":"2016-02-19 11:40:55","text":"","dead":1,"parent":0,"poll":0,"kids":[11133170],"url":"https:\/\/www.washingtonpost.com\/news\/morning-mix\/wp\/2016\/02\/18\/s-f-tech-bro-writes-open-letter-to-mayor-i-shouldnt-have-to-see-the-pain-struggle-and-despair-of-homeless-people\/","score":3,"title":"SF ‘tech bro’ writes to mayor: ‘I shouldn’t have to see the despair of homeless’","parts":[],"descendants":0}
{"id":11132930,"deleted":0,"type":"comment","by":"kherraza","time":"2016-02-19 11:41:07","text":"a new way to travel without moving through a new system!","dead":0,"parent":11132928,"poll":0,"kids":[],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132931,"deleted":0,"type":"comment","by":"DanielBMarkham","time":"2016-02-19 11:41:50","text":"I don&#x27;t want huge denominations, but assuming inflation over the last 50 years, seems to me that we should have a $500US note.<p>Yes, I understand if LE had their way we&#x27;d be paying with 5-spots, but convenience has to mean something also. Let&#x27;s bring back the $500 bill and then index the entire thing to inflation such that there isn&#x27;t more than a dozen or so steps between the smallest and largest monetary units.<p>I don&#x27;t think this is a political discussion&#x2F;argument we need to have constantly. Fix it once and then leave it alone. I&#x27;m also completely opposed to eliminating all currency and going totally electronic, which sounds like an even more dystopian state than the current one our betters have created for us over the last decade or two.","dead":0,"parent":11132443,"poll":0,"kids":[11132960],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132932,"deleted":0,"type":"comment","by":"choosername","time":"2016-02-19 11:41:50","text":"&gt; With math, there are no docs, no playground, no explanations, no nothing. Either you are the part of mathematical community and can hope for explanations and knowledge transfer, or you are not<p>what&#x27;s the difference to CS here, where did you get that coding sample you mentioned? The playground is your mind, pebbles or pen and paper, maths are a projection of the real world.<p>Mathematics is not inconsistent. Isn&#x27;t this the premisses of rigor? Math has mathematical consistency and that&#x27;s not the same as literal consistency, but maybe that&#x27;s a problem in semiotics and language. The language and the literature is inconsistent.","dead":0,"parent":11132614,"poll":0,"kids":[11132963],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132933,"deleted":0,"type":"story","by":"mt_caret","time":"2016-02-19 11:42:32","text":"","dead":0,"parent":0,"poll":0,"kids":[],"url":"https:\/\/github.com\/php\/php-src\/commit\/a0724d30817600540946b41e40f4cfc2a0c30f80","score":3,"title":"Commit to revert to mistaken implementation of mt_rand()","parts":[],"descendants":0}
{"id":11132934,"deleted":0,"type":"story","by":"rayascott","time":"2016-02-19 11:42:34","text":"","dead":0,"parent":0,"poll":0,"kids":[],"url":"http:\/\/www.wired.com\/2015\/10\/this-living-clothing-morphs-when-you-sweat\/","score":1,"title":"This Living Clothing Morphs When You Sweat","parts":[],"descendants":0}
{"id":11132935,"deleted":0,"type":"comment","by":"refal","time":"2016-02-19 11:43:03","text":"I&#x27;m basically with you.<p>However, as a German, I find it interesting why you mention Germany as &quot;less-principled&quot;. Less-principled than the US? Do you talk about current Germany or about former east Germany or even Nazi Germany?<p>Of course, there are enough problems here as anywhere else regarding privacy, etc. But I have difficulties seeing current Germany as &quot;less-principled&quot; than the US wrt. privacy, human rights etc.<p>Just curious what your impression is based on.","dead":0,"parent":11132330,"poll":0,"kids":[],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132936,"deleted":0,"type":"comment","by":"rwmj","time":"2016-02-19 11:43:32","text":"Against an insufficiently smart attacker.  How about a computer that can learn to imitate any speech, perhaps by modelling the shape of the vocal tract (which is how modern speech synthesizers actually work, so it&#x27;s not a huge leap).","dead":0,"parent":11132918,"poll":0,"kids":[11133186,11132982],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132937,"deleted":0,"type":"comment","by":"noir_lord","time":"2016-02-19 11:43:56","text":"Except the note size is kind of secondary here.<p>Having limits on transactions over 1000 euro (like France) does forces law-abiding citizens to handle transactions in a way that can be monitored by the security services (the non-law abiding citizens of course just ignore the damn law or wash the money through a front).<p>It&#x27;s yet another attack on privacy, if I want to buy a bike from someone legally and pay in cash for it what business is it of the governments, it&#x27;s a private transaction between two parties for a legally owned and sold item.<p>I&#x27;m rapidly coming to the view that Orwell wasn&#x27;t far of the mark with &quot;If you want a vision of the future, imagine a boot stamping on a human face - forever.&quot; except instead of an actual jackboot we just have the complete removal of privacy, fear of the boot stamping on your face instead of an actual boot.","dead":0,"parent":11132917,"poll":0,"kids":[],"url":"","score":0,"title":"","parts":[],"descendants":0}
{"id":11132938,"deleted":0,"type":"story","by":"vickymehta","time":"2016-02-19 11:44:07","text":"http:&#x2F;&#x2F;goo.gl&#x2F;tW7F2j","dead":1,"parent":0,"poll":0,"kids":[],"url":"","score":1,"title":"Letting You Online Stores to Find the Best Brand for You and Your Family","parts":[],"descendants":0}
